Revit 2027 API
BuiltInFailures.RebarFailures.DelayedConstraintForHandle Property
 The selected constraint targets do not satisfy a valid constraint. The rebar preview corresponds to latest valid rebar constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DelayedConstraintForHandle { get; }
Public Shared ReadOnly Property DelayedConstraintForHandle As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DelayedConstraintForHandle {
	FailureDefinitionId^ get ();
}
static member DelayedConstraintForHandle : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace